FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC43xx/LPC43xx_USBHost.c
    if (error != UEZ_ERROR_NONE)
        return error;

    // Wait a little bit (2 ms)
    UEZBSPDelayMS(2);

    // Change the control to go to the address
    EDCtrl->Control = (EDCtrl->Control & (~0x7F)) | aAddress;

    return error;
}


/*---------------------------------------------------------------------------*
 * Routine:  Host_CtrlRecv
 *---------------------------------------------------------------------------*
 * Description:
 *      Receive control information.  Data is received in the common
 *      transfer descriptor (if aLength > 0).
 * Inputs:
 *      void *aWorkspace            -- USB Host controller workspace
 *      TUInt8 aBMRequestType       -- Type of request
 *      TUInt8 aRequest             -- Request
 *      TUInt16 aValue              -- Value for request
 *      TUInt16 aIndex              -- Index for request
 *      TUInt16 aLength             -- Length of data in command
 *                                      (currently in TDBuffer)
 * Outputs:
 *      T_uezError                  -- UEZ_ERROR_NONE if successful, else
 *                                      error code.
 *---------------------------------------------------------------------------*/
static T_uezError Host_CtrlRecv(
            void *aWorkspace,
            void *aBuffer,
            TUInt8 aDeviceAddress,
            TUInt8 aBMRequestType,
            TUInt8 aRequest,
            TUInt16 aValue,
            TUInt16 aIndex,
            TUInt32 aLength,
            TUInt32 aTimeout)
{
    T_uezError error;
    T_LPC43xx_USBHost_Workspace *p = (T_LPC43xx_USBHost_Workspace *)aWorkspace;

    IHost_FillSetup(p, aBMRequestType, aRequest, aValue, aIndex, aLength);
    error = Host_ProcessTD(aWorkspace, EDCtrl, TD_SETUP, TDBuffer, 8, aTimeout);
    if (error == UEZ_ERROR_NONE) {
        // Get the data (if any)
        if (aBuffer)
            error = Host_ProcessTD(aWorkspace, EDCtrl, TD_IN, aBuffer, aLength, aTimeout);

        // Send an ACK
        if (error == UEZ_ERROR_NONE)
            error = Host_ProcessTD(aWorkspace, EDCtrl, TD_OUT, 0, 0, aTimeout);
    }
    return error;
}

/*---------------------------------------------------------------------------*
 * Routine:  Host_SetCallbacks
 *---------------------------------------------------------------------------*
 * Description:
 *      Declare callbacks for this workspace.
 * Inputs:
 *      void *aWorkspace            -- USB Host controller workspace
 *      void *aCallbackWorkspace    -- Workspace used when call back called
 *      const T_USBHostCallbacks *aCallbackAPI -- Structure holding callback
 *                                      routines to be called.
 * Outputs:
 *      T_uezError                  -- UEZ_ERROR_NONE if successful, else
 *                                      error code.
 *---------------------------------------------------------------------------*/
static T_uezError Host_SetCallbacks(
        void *aWorkspace,
        void *aCallbackWorkspace,
        const T_USBHostCallbacks *aCallbackAPI)
{
    T_LPC43xx_USBHost_Workspace *p = (T_LPC43xx_USBHost_Workspace *)aWorkspace;

    p->iCallbackAPI = aCallbackAPI;
    p->iCallbackWorkspace = aCallbackWorkspace;

    return UEZ_ERROR_NONE;
}

static T_usbHostDeviceState Host_GetState(void *aWorkspace)
{
    T_LPC43xx_USBHost_Workspace *p = (T_LPC43xx_USBHost_Workspace *)aWorkspace;
    return p->iState;
}

static void Host_ResetPort(void *aWorkspace)
{
    T_LPC43xx_USBHost_Workspace *p = (T_LPC43xx_USBHost_Workspace *)aWorkspace;

    UEZTaskDelay(100);

    // Apply port reset
    *p->iPortStatus |= OR_RH_PORT_PRS;

    // Wait for 100 MS after port reset
    UEZTaskDelay(100);

    // Default max packet size to 8 to ensure compatibility
    EDCtrl->Control = (EDCtrl->Control & ~(0x7FF<<16)) | (8 << 16);
}

T_uezError Host_Control(
            void *aWorkspace,
            TUInt8 aDeviceAddress,
            TUInt8 aBMRequestType,
            TUInt8 aRequest,
            TUInt16 aValue,
            TUInt16 aIndex,
            TUInt16 aLength,
            void *aBuffer,
            TUInt32 aTimeout)
{
    return Host_CtrlRecv(
            aWorkspace,
            aBuffer,
            aDeviceAddress,
            aBMRequestType,
            aRequest,
            aValue,
            aIndex,
            aLength,
            aTimeout);
}

T_uezError Host_ControlOut(
            void *aWorkspace,
            TUInt8 aDeviceAddress,
            TUInt8 aBMRequestType,
            TUInt8 aRequest,
            TUInt16 aValue,
            TUInt16 aIndex,
            TUInt16 aLength,
            void *aBuffer,
            TUInt32 aTimeout)
{
    return Host_CtrlSend(
            aWorkspace,
            aBuffer,
            aDeviceAddress,
            aBMRequestType,
            aRequest,
            aValue,
            aIndex,
            aLength,
            aTimeout);
}

T_uezError Host_GetDescriptor(
            void *aWorkspace,
            TUInt8 aDeviceAddress,
            TUInt8 aType,
            TUInt8 aIndex,
            TUInt8 *aBuffer,
            TUInt32 aSize,
            TUInt32 aTimeout)
{
    return Host_CtrlRecv(
        aWorkspace,
        aBuffer,
        aDeviceAddress,
        USB_DEVICE_TO_HOST | USB_RECIPIENT_DEVICE,
        GET_DESCRIPTOR,
        (aType << 8)|(aIndex),
        0,
        aSize,
        aTimeout);
}

T_uezError Host_GetString(
            void *aWorkspace,
            TUInt8 aDeviceAddress,
            TUInt32 aIndex,
            TUInt8 *aBuffer,
            TUInt32 aSize,
            TUInt32 aTimeout)
{
    return Host_CtrlRecv(
        aWorkspace,
        aBuffer,
        aDeviceAddress,
        USB_DEVICE_TO_HOST | USB_RECIPIENT_DEVICE,
        GET_DESCRIPTOR,
        (3 << 8)|(aIndex),
        0,
        aSize,
        aTimeout);
}

T_uezError Host_BulkOut(
            void *aWorkspace,
            TUInt8 aDeviceAddress,
            TUInt8 aEndpoint,
            TUInt8 *aBuffer,
            TUInt32 aSize,
            TUInt32 aTimeout)
{
    T_uezError error;
    volatile HCED *hced = EDBulkOut;
    T_LPC43xx_USBHost_Workspace *p = (T_LPC43xx_USBHost_Workspace *)aWorkspace;

    // Configure the bulk end point
    // with the proper end point and address
    hced->Control =
        (hced->Control & ~((0x7F<<0)|(0x7F<<7))) |
        (aDeviceAddress << 0) |
        ((aEndpoint & 0x7F) << 7);
    if (p->iSpeed == USB_HOST_SPEED_LOW)
        hced->Control |= ED_SPEED_LOW;

    // Now process that end point
    error = Host_ProcessTD(aWorkspace, hced, TD_OUT, aBuffer, aSize, aTimeout);

    return error;
}

T_uezError Host_BulkIn(
            void *aWorkspace,
            TUInt8 aDeviceAddress,
            TUInt8 aEndpoint,
            TUInt8 *aBuffer,
            TUInt32 aSize,
            TUInt32 aTimeout)
{
    T_uezError error;
    volatile HCED *hced = EDBulkIn;
    T_LPC43xx_USBHost_Workspace *p = (T_LPC43xx_USBHost_Workspace *)aWorkspace;

    // Configure the bulk end point
    // with the proper end point and address
    hced->Control =
        (hced->Control & ~((0x7F<<0)|(0x7F<<7))) |
        (aDeviceAddress << 0) |
        ((aEndpoint & 0x7F) << 7);
    if (p->iSpeed == USB_HOST_SPEED_LOW)
        hced->Control |= ED_SPEED_LOW;

    // Now process that end point
    error = Host_ProcessTD(aWorkspace, hced, TD_IN, aBuffer, aSize, aTimeout);

    return error;
}

