FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC43xx/LPC43xx_USBHost.c
T_uezError Host_InterruptOut(
            void *aWorkspace,
            TUInt8 aDeviceAddress,
            TUInt8 aEndpoint,
            const TUInt8 *aBuffer,
            TUInt32 aSize,
            TUInt32 aTimeout)
{
    T_uezError error;
    volatile HCED *hced = EDInterruptOut;
    T_LPC43xx_USBHost_Workspace *p = (T_LPC43xx_USBHost_Workspace *)aWorkspace;

    // Configure the interrupt end point
    // with the proper end point and address
    hced->Control =
        (hced->Control & ~((0x7F<<0)|(0x7F<<7))) |
        (aDeviceAddress << 0) |
        ((aEndpoint & 0x7F) << 7);
    if (p->iSpeed == USB_HOST_SPEED_LOW)
        hced->Control |= ED_SPEED_LOW;

    // Now process that end point
    error = Host_ProcessTD(aWorkspace, hced, TD_OUT, (TUInt8 *)aBuffer, aSize, aTimeout);

    return error;
}

T_uezError Host_InterruptIn(
            void *aWorkspace,
            TUInt8 aDeviceAddress,
            TUInt8 aEndpoint,
            TUInt8 *aBuffer,
            TUInt32 aSize,
            TUInt32 aTimeout)
{
    T_uezError error;
    volatile HCED *hced = EDInterruptIn;
    T_LPC43xx_USBHost_Workspace *p = (T_LPC43xx_USBHost_Workspace *)aWorkspace;

    // Configure the interrupt end point
    // with the proper end point and address
    hced->Control =
        (hced->Control & ~((0x7F<<0)|(0x7F<<7))) |
        (aDeviceAddress << 0) |
        ((aEndpoint & 0x7F) << 7);
    if (p->iSpeed == USB_HOST_SPEED_LOW)
        hced->Control |= ED_SPEED_LOW;

    // Now process that end point
    error = Host_ProcessTD(aWorkspace, hced, TD_IN, aBuffer, aSize, aTimeout);

    return error;
}

T_uezError Host_SetConfiguration(
            void *aWorkspace,
            TUInt8 aDeviceAddress,
            TUInt32 aConfigurationNum)
{
    return Host_CtrlSend(
            aWorkspace,
            0,
            aDeviceAddress,
            USB_HOST_TO_DEVICE | USB_RECIPIENT_DEVICE,
            SET_CONFIGURATION,
            aConfigurationNum,
            0,
            0,
            TIMEOUT_STANDARD);
}

T_uezError Host_SetControlPacketSize(
            void *aWorkspace,
            TUInt8 aDeviceAddress,
            TUInt16 aPacketSize)
{
    PARAM_NOT_USED(aWorkspace);

    if (aPacketSize > 256)
        return UEZ_ERROR_ILLEGAL_PARAMETER;

    EDCtrl->Control = (EDCtrl->Control & ~(0x7FF<<16)) | (aPacketSize << 16);

    return UEZ_ERROR_NONE;
}

T_uezError Host_ConfigureEndpoint(
        void *aWorkspace,
        TUInt8 aDeviceAddress,
        TUInt8 aEndpointAndInOut,   // bit 0x80 is set if IN
        TUInt16 aMaxPacketSize)
{
//    T_LPC43xx_USBHost_Workspace *p = (T_LPC43xx_USBHost_Workspace *)aWorkspace;

    // For now, we'll set the one endpoint
    if (aEndpointAndInOut & 0x80) {
        EDBulkIn->Control =
            aDeviceAddress | // USB Address
            ((aEndpointAndInOut & 0x7F) << 7) | // Endpoint address
            (2 << 11) | // direction
            (aMaxPacketSize << 16);
        EDInterruptIn->Control =
            aDeviceAddress | // USB Address
            ((aEndpointAndInOut & 0x7F) << 7) | // Endpoint address
            (2 << 11) | // direction
            (aMaxPacketSize << 16);
    } else {
        EDBulkOut->Control =
            aDeviceAddress | // USB Address
            ((aEndpointAndInOut & 0x7F) << 7) | // Endpoint address
            (1 << 11) | // direction
            (aMaxPacketSize << 16);
        EDInterruptOut->Control =
            aDeviceAddress | // USB Address
            ((aEndpointAndInOut & 0x7F) << 7) | // Endpoint address
            (1 << 11) | // direction
            (aMaxPacketSize << 16);
    }

    return UEZ_ERROR_NONE;
}

T_usbHostSpeed Host_GetRootPortDetectedSpeed(void *aWorkspace)
{
    T_LPC43xx_USBHost_Workspace *p = (T_LPC43xx_USBHost_Workspace *)aWorkspace;

    // Just look at the status flag
    if ((*p->iPortStatus) & OR_RH_PORT_LOW_SPEED_ATTACHED)
        return USB_HOST_SPEED_LOW;

    return USB_HOST_SPEED_FULL;
}

T_uezError Host_SetRootPortSpeed(void *aWorkspace, T_usbHostSpeed aNewSpeed)
{
    T_LPC43xx_USBHost_Workspace *p = (T_LPC43xx_USBHost_Workspace *)aWorkspace;

    if (aNewSpeed == USB_HOST_SPEED_LOW) {
        // Change all the endpoint descriptors to use the low speed
        EDCtrl->Control |= ED_SPEED_LOW;
        EDBulkIn->Control |= ED_SPEED_LOW;
        EDBulkOut->Control |= ED_SPEED_LOW;
        EDInterruptIn->Control |= ED_SPEED_LOW;
        EDInterruptOut->Control |= ED_SPEED_LOW;
    } else {
        // Change all the endpoint descriptors to use the full speed
        EDCtrl->Control &= ~ED_SPEED_LOW;
        EDBulkIn->Control &= ~ED_SPEED_LOW;
        EDBulkOut->Control &= ~ED_SPEED_LOW;
        EDInterruptIn->Control &= ~ED_SPEED_LOW;
        EDInterruptOut->Control &= ~ED_SPEED_LOW;
    }
    p->iSpeed = aNewSpeed;
    return UEZ_ERROR_NONE;
}

const HAL_USBHost G_LPC43xx_USBHost_Interface_PortA = {
    // T_halInterface iInterface
    {
        "LPC43xx:USBHost:PortA",
        0x0100,
        LPC43xx_USBHost_InitializeWorkspace_PortA,
        sizeof(T_LPC43xx_USBHost_Workspace),
    },

    Host_SetCallbacks,
    Host_Init,
    Host_ResetPort,
    Host_ResetBuffers,
    Host_AllocBuffer,
    Host_ProcessTD,
    Host_GetState,

    Host_SetControlPacketSize,
    Host_SetAddress,
    Host_ConfigureEndpoint,
    Host_SetConfiguration,

    Host_Control,
    Host_GetDescriptor,
    Host_GetString,
    Host_BulkOut,
    Host_BulkIn,
    Host_InterruptOut,
    Host_InterruptIn,

    Host_GetRootPortDetectedSpeed,
    Host_SetRootPortSpeed,

    Host_ControlOut,
};


const HAL_USBHost G_LPC43xx_USBHost_Interface_PortB = {
    // T_halInterface iInterface
    {
        "LPC43xx:USBHost:PortB",
        0x0100,
        LPC43xx_USBHost_InitializeWorkspace_PortB,
        sizeof(T_LPC43xx_USBHost_Workspace),
    },

