FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC43xx/LPC43xx_USBHost.c
    Host_SetCallbacks,
    Host_Init,
    Host_ResetPort,
    Host_ResetBuffers,
    Host_AllocBuffer,
    Host_ProcessTD,
    Host_GetState,

    Host_SetControlPacketSize,
    Host_SetAddress,
    Host_ConfigureEndpoint,
    Host_SetConfiguration,

    Host_Control,
    Host_GetDescriptor,
    Host_GetString,
    Host_BulkOut,
    Host_BulkIn,
    Host_InterruptOut,
    Host_InterruptIn,

    Host_GetRootPortDetectedSpeed,
    Host_SetRootPortSpeed,

    Host_ControlOut,
};

/*---------------------------------------------------------------------------*
 * Requirement routines:
 *---------------------------------------------------------------------------*/
//void LPC43xx_USBHost_VBUS_Require(T_uezGPIOPortPin aPin)
//{
//    static const T_LPC43xx_IOCON_ConfigList pins[] = {
//            {GPIO_P1_30, IOCON_A_DEFAULT(2)}, // USB_VBUS
//    };
//    HAL_DEVICE_REQUIRE_ONCE();
//    LPC43xx_IOCON_ConfigPinOrNone(aPin, pins, ARRAY_COUNT(pins));
//
//}
void LPC43xx_USBHost_PortA_Require(const T_LPC43xx_USBHost_Settings *aSettings)
{
    //USB0

    HAL_DEVICE_REQUIRE_ONCE();
    // Register USB Host driver ports for LPC24xx
    HALInterfaceRegister("USBHost:PortA",
            (T_halInterface *)&G_LPC43xx_USBHost_Interface_PortA, 0, 0);
}

void LPC43xx_USBHost_PortB_Require(const T_LPC43xx_USBHost_Settings *aSettings)
{
    //USB1
    HAL_DEVICE_REQUIRE_ONCE();
    // Register USB Host driver ports for LPC24xx
    HALInterfaceRegister("USBHost:PortB",
            (T_halInterface *)&G_LPC43xx_USBHost_Interface_PortB, 0, 0);
}

#endif

/*-------------------------------------------------------------------------*
 * End of File:  LPC43xx_USBHost.c
 *-------------------------------------------------------------------------*/
